#+TAGS: @home @office @calendar @Trash @memo @life @work @summary @blog @c++ @python @arithmetic @redis @mongodb @mysql @c @java @scala @hadoop @R @spark @machine_learning @octopress @learn

* Five_Years_Plan(2015.07-2020.07)
** Job_list 
*** Periodic Activity
**** Hold Running_time                                                          :@life:@calendar:
    SCHEDULED: <2015-07-09 Thu 06:00-07:00 +1w>
**** TODO Running_time                                                          :@life:@calendar:
     SCHEDULED: <2015-07-13 Mon 06:00-07:00 +1w>
**** TODO Fitness_time                                                          :@life:@calendar:
    SCHEDULED: <2015-07-10 Fri 21:30-22:30 +1w>
**** TODO Fitness_time                                                          :@life:@calendar:
    SCHEDULED: <2015-07-13 Mon 21:30-22:30 +1w>
**** TODO Noon_break_time                                                       :@life:@calendar:
     SCHEDULED: <2015-07-14 Tue 12:00-14:00 +1d>
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "done"       from "TODO"       [2015-07-09 Thu 17:48]
     - State "done"       from "TODO"       [2015-07-09 Thu 14:16]
     - State "done"       from "STARTED"    [2015-07-09 Thu 14:02]
    :LOGBOOK:
    CLOCK: [2015-07-09 Thu 13:32]--[2015-07-09 Thu 14:02] =>  0:30
    :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 23:15]
     :END:
**** TODO Reading_time                                                          :@home:@calendar:@learn:
     SCHEDULED: <2015-07-22 Wed 18:00-21:00 +1w>
     - State "done"       from "TODO"       [2015-07-08 Wed 20:34]
     - State "done"       from "TODO"       [2015-07-08 Wed 20:33]
     :LOGBOOK:
     CLOCK: [2015-07-08 Wed 19:11]--[2015-07-08 Wed 20:32] =>  1:21
     :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-08 Wed 20:34]
     :END:
**** TODO Reading_time
     SCHEDULED: <2015-07-10 Fri 18:00-21:00 +1w>
**** TODO Reading_time
     SCHEDULED: <2015-07-13 Mon 18:00-21:00 +1w>
**** TODO Coding_time
     SCHEDULED: <2015-08-20 Thu 18:00-21:00 +1w>
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:12]
     - State "done"       from "TODO"       [2015-07-09 Thu 21:23]
     - State "done"       from "TODO"       [2015-07-09 Thu 20:50]
     - State "done"       from "STARTED"    [2015-07-09 Thu 20:50]
     :LOGBOOK:
     CLOCK: [2015-07-09 Thu 18:07]--[2015-07-09 Thu 20:50] =>  2:43
     :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 23:15]
     :END:
**** TODO Coding_time
     SCHEDULED: <2015-07-11 Sat 18:00-21:00 +1w>
**** TODO Coding_time
     SCHEDULED: <2015-07-14 Tue 18:00-21:00 +1w>
**** TODO Drink_water_01
     SCHEDULED: <2015-07-10 Fri 06:30 +1d>
     - State "done"       from "TODO"       [2015-07-09 Thu 09:28]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 09:28]
     :END:
**** TODO Drink_water_02
     SCHEDULED: <2015-07-10 Fri 08:30>
     - State "done"       from "TODO"       [2015-07-09 Thu 09:30]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 09:30]
     :END:
**** TODO Drink_water_03
     SCHEDULED: <2015-07-10 Fri 10:30 +1d>
     - State "done"       from "TODO"       [2015-07-09 Thu 11:28]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 11:28]
     :END:
**** TODO Drink_water_04
     SCHEDULED: <2015-07-10 Fri 12:30 +1d>
     - State "done"       from "TODO"       [2015-07-09 Thu 14:02]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 14:02]
     :END:
**** TODO Drink_water_05
     SCHEDULED: <2015-07-10 Fri 14:30 +1d>
     - State "done"       from "TODO"       [2015-07-09 Thu 14:44]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 14:44]
     :END:
**** TODO Drink_water_06
     SCHEDULED: <2015-07-10 Fri 16:30 +1d>
     - State "done"       from "TODO"       [2015-07-09 Thu 16:39]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 16:39]
     :END:
**** TODO Drink_water_07
     SCHEDULED: <2015-07-10 Fri 18:30 +1d>
     - State "done"       from "TODO"       [2015-07-09 Thu 19:19]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 19:19]
     :END:
**** TODO Drink_water_08
     SCHEDULED: <2015-07-10 Fri 19:30 +1d>
     - State "done"       from "TODO"       [2015-07-09 Thu 19:29]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 19:29]
     :END:
**** TODO Sleep_time
     SCHEDULED: <2015-07-09 Thu 23:30-05:00 +1d>
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:16]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 23:16]
     :END:
**** Hold Speaking_time
     SCHEDULED: <2015-07-09 Thu 05:00-06:00 +1d>
**** TODO Reading_time
     SCHEDULED: <2015-07-10 Fri 22:30-23:30 +1d>
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 23:15]
     :END:
**** TODO Writing_time
     SCHEDULED: <2015-07-15 Wed 21:00-22:30 +1w>
     - State "done"       from "TODO"       [2015-07-08 Wed 20:57]
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-08 Wed 20:57]
     :END:
**** TODO Writing_time
     SCHEDULED: <2015-08-13 Thu 21:00-22:30 +1w>
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:15]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:12]
     - State "done"       from "TODO"       [2015-07-09 Thu 21:23]
     - State "done"       from "STARTED"    [2015-07-09 Thu 21:23]
     :LOGBOOK:
     CLOCK: [2015-07-09 Thu 20:57]--[2015-07-09 Thu 21:23] =>  0:26
     :END:
     :PROPERTIES:
     :LAST_REPEAT: [2015-07-09 Thu 23:15]
     :END:
**** TODO Writing_time
     SCHEDULED: <2015-07-14 Tue 21:00-22:30 +1w>
**** TODO Writing_time
     SCHEDULED: <2015-07-11 Sat 21:00-22:30 +1w>
**** TODO Writing_time
     SCHEDULED: <2015-07-12 Sun 21:00-22:30 +1w>
**** TODO Writing_time
     SCHEDULED: <2015-07-10 Fri 16:00-17:30 +1w>
**** TODO Writing_time
     SCHEDULED: <2015-07-13 Mon 16:00-17:30 +1w>
**** TODO Study_time
     SCHEDULED: <2015-07-11 Sat 8:00-12:00 +1w>
**** TODO Study_time
     SCHEDULED: <2015-07-11 Sat 14:00-17:30 +1w>
**** TODO Plan_time
     SCHEDULED: <2015-07-12 Sun 8:00-12:00 +2w>
**** TODO Plan_time
     SCHEDULED: <2015-07-19 Sun 14:00-17:30 +2w>
**** TODO Clean up the room
     SCHEDULED: <2015-07-12 Sun 14:00-17:30 +2w>
**** TODO Clean up the room
     SCHEDULED: <2015-07-19 Sun 8:00-12:00 +2w>
**** TODO Review_time
     SCHEDULED: <2015-07-12 Sun 19:30-20:30 +1w>
*** Projects 
**** Back_end development engineer
***** STARTED python flask
      DEADLINE: <2015-07-10 Fri>
      - State "STARTED"    from "done"       [2015-07-09 Thu 11:31]
      - State "done"       from "STARTED"    [2015-07-09 Thu 11:30]
      :LOGBOOK:
      CLOCK: [2015-07-09 Thu 14:17]--[2015-07-09 Thu 16:32] =>  2:15
      CLOCK: [2015-07-09 Thu 09:32]--[2015-07-09 Thu 11:45] =>  2:13
      :END:
***** STARTED Mysql
      DEADLINE: <2015-07-14 Tue>
      :LOGBOOK:
      :END:
***** Sql Alchemy 
      DEADLINE: <2015-07-17 Fri>
***** Mongodb
      DEADLINE: <2015-07-21 Tue>
***** Pymongo
      DEADLINE: <2015-07-23 Thu>
***** Redis
      DEADLINE: <2015-07-27 Mon>
***** Redis-py
      DEADLINE: <2015-07-29 Wed>
**** Technology_book_list
***** <Programming in C>[0%]
  - [-] Theory Note[21%]
    - [X] Chapter One
    - [X] Chapter Two
    - [X] Chapter Three
	- [X] Chapter Four
	- [ ] Chapter Five
	- [ ] Chapter Six
	- [ ] Chapter Seven
	- [ ] Chapter Eight
	- [ ] Chapter Nine
	- [ ] Chapter Ten
	- [ ] Chapter Eleven
	- [ ] Chapter Twelve
	- [ ] Chapter Thirteen
	- [ ] Chapter Fourteen
	- [ ] Chapter Fifteen
	- [ ] Chapter Sixteen
	- [ ] Chapter Seventeen
	- [ ] Chapter Eighteen
	- [ ] Chapter Nineteen
  - [-] LAB Note[21%]
    - [X] Chapter One
    - [X] Chapter Two
    - [X] Chapter Three
	- [X] Chapter Four
	- [ ] Chapter Five
	- [ ] Chapter Six
	- [ ] Chapter Seven
	- [ ] Chapter Eight
	- [ ] Chapter Nine
	- [ ] Chapter Ten
	- [ ] Chapter Eleven
	- [ ] Chapter Twelve
	- [ ] Chapter Thirteen
	- [ ] Chapter Fourteen
	- [ ] Chapter Fifteen
	- [ ] Chapter Sixteen
	- [ ] Chapter Seventeen
	- [ ] Chapter Eighteen
	- [ ] Chapter Nineteen
***** <Code:The Hidden Language of Computer Hardware and Software>
***** <Structure and INterpretation of Comuputer Programs>
***** <The Elements of Computing Systems>
***** <Computer Systems A Programmer's Perspetive>
***** <The C Programming Language>
***** <The UNIX Programming Environment>
***** <The Art of UNIX Programming>
***** <Introduction to Algorithms>
***** <The Practice of Programming>
***** <Programming Pearls>
***** <C++ Primer>
***** <Effective C++>
***** <Inside C++ Object Model>
***** <C++ Templates>
***** <The Design and Evolution of C++>
***** <Code Complete>
***** <The Science Of Programming Gries>
***** <Elemental Design Pattern>
***** <Elements of Programming>
***** <Principles and Practice Using C++>
***** <The Standard C Library>
***** <Pointer On C>
***** <C Traps And Pitfalls>
***** <C A Reference Manual>
***** <C Interfaces and Implementations>
***** <Expert C Programming:Deep C Secrets>
***** <The C++ Standard Library>
***** <The C++ Programming Language>
***** <More Programming Pearls Confessions of a Coder>
***** <Langurage Implementation Patterns>
***** <Algorithms On Strings Trees And Sequences>
***** <Algorithms Design Manual>
***** <The Science Of Programming>
***** <Algorithms>
***** <Introdution To The Design And Analysis Of Algorithms>
***** <Introdution To Algorithms: A Creative Approach>
***** <More Programming Pearls>
***** <Programming Language Pragmatics>
***** <Data Structures And Problem Solving: Using C>
***** <Code Optimization: Effective Memory Usage>
***** <Refactoring Improving The Design Of Existing Code>
***** <How To Design Programs>
**** Technology_class_list
***** <Introduction To Computer Science And Programming Using Python>
***** <Harvard CS50>
***** <Udacity CS212 Design Of Computer Program>
***** <UC Berkeley SICP>
***** <MIT Learning SICP>
***** <Coursera The Hardware/Software Interface>
***** <Coursera Algorithms: Design And Analysis>
***** <MIT Introdution to Algorithms>
***** <Coursera Programming Languages>
***** <Udacity CS262 Programming Language>
***** <Advanced Data Structures>
*** Next Action
**** done Have A Dinner
     CLOSED: [2015-07-08 Wed 19:09]
     - State "done"       from "STARTED"    [2015-07-08 Wed 19:09]
     :LOGBOOK:
     CLOCK: [2015-07-08 Wed 18:32]--[2015-07-08 Wed 19:09] =>  0:37
     :END:
**** DONE Buy Some Snacks
     CLOSED: [2015-07-09 Thu 23:13]
     - State "DONE"       from "TODO"       [2015-07-09 Thu 23:13]
**** DONE Catch The Regular Bus 
     CLOSED: [2015-07-09 Thu 23:13]
     - State "DONE"       from ""           [2015-07-09 Thu 23:13]
     - State "done"       from "TODO"       [2015-07-09 Thu 09:34]
     <2015-07-08 21:30>
**** DONE Go to the bathroom on the toilet
     CLOSED: [2015-07-09 Thu 23:13]
     - State "DONE"       from ""           [2015-07-09 Thu 23:13]
     - State "done"       from "TODO"       [2015-07-09 Thu 09:38]
**** DONE Go to the bathroom on the toilet
     CLOSED: [2015-07-09 Thu 23:14]
     - State "DONE"       from ""           [2015-07-09 Thu 23:14]
     - State "done"       from "TODO"       [2015-07-09 Thu 14:16]
**** DONE Go to the bathroot on the toilet
     CLOSED: [2015-07-09 Thu 23:14]
     - State "DONE"       from ""           [2015-07-09 Thu 23:14]
     - State "done"       from "TODO"       [2015-07-09 Thu 16:49]
**** DONE Search some information about MYSQL
     CLOSED: [2015-07-09 Thu 23:14]
     - State "DONE"       from ""           [2015-07-09 Thu 23:14]
     - State "done"       from "TODO"       [2015-07-09 Thu 17:22]
**** DONE Search some information about sql alchemy
     CLOSED: [2015-07-09 Thu 23:14]
     - State "DONE"       from ""           [2015-07-09 Thu 23:14]
     - State "done"       from "TODO"       [2015-07-09 Thu 17:22]
**** DONE Search some information about Mongodb
     CLOSED: [2015-07-09 Thu 23:14]
     - State "DONE"       from ""           [2015-07-09 Thu 23:14]
     - State "done"       from "TODO"       [2015-07-09 Thu 17:22]
**** DONE Search some information about Pymongo
     CLOSED: [2015-07-09 Thu 23:14]
     - State "DONE"       from ""           [2015-07-09 Thu 23:14]
     - State "done"       from "TODO"       [2015-07-09 Thu 17:22]
**** DONE Search some information about Redis
     CLOSED: [2015-07-09 Thu 23:14]
     - State "DONE"       from ""           [2015-07-09 Thu 23:14]
     - State "done"       from "TODO"       [2015-07-09 Thu 17:22]
**** DONE Search some information about Redis-py
     CLOSED: [2015-07-09 Thu 23:14]
     - State "DONE"       from ""           [2015-07-09 Thu 23:14]
     - State "done"       from "TODO"       [2015-07-09 Thu 17:22]
** temporary_list